In [1]:
a = 1
b = 2

l1 = [a, b]

In [3]:
x = list(range(1000000))

In [5]:
%%timeit
sum(x)

31.5 ms ± 3.06 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [1]:
from array import array

In [4]:
y = array('l',x)

In [5]:
%%timeit
sum(y)

40.4 ms ± 5.01 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [7]:
import numpy as np

y = np.array(x)

In [8]:
%%timeit
y.sum()

712 µs ± 30 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

In [9]:
40.4*1000/712

56.741573033707866

In [10]:
y.mean()

499999.5

In [11]:
# Square a list using Python
squared_values = []
for number in range(10):
    squared_values.append(number*number)

print(squared_values)

# Square a list using NumPy
import numpy as np

vector = np.array(range(10))
scalar = 5
print(vector * scalar)
print(vector * vector)

[0, 1, 4, 9, 16, 25, 36, 49, 64, 81]
[ 0  5 10 15 20 25 30 35 40 45]
[ 0  1  4  9 16 25 36 49 64 81]

In [12]:
vector

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [13]:
my_list = [1, 2, 3]
print(my_list)

import numpy as np

my_vector = np.array(my_list)
print(my_vector)

my_matrix = np.array([my_list, my_list])

[1, 2, 3]
[1 2 3]

In [14]:
my_matrix

array([[1, 2, 3],
       [1, 2, 3]])

In [15]:
np.hstack([my_list, my_list])

array([1, 2, 3, 1, 2, 3])

In [16]:
my_nested_list = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
my_matrix = np.array(my_nested_list)
print(my_matrix)

[[1 2 3]
 [4 5 6]
 [7 8 9]]

In [17]:
my_list1 = [[1,2], [3,4]]
my_list2 = [[5,6], [7,8]]

In [18]:
np.hstack([my_list1, my_list2])

array([[1, 2, 5, 6],
       [3, 4, 7, 8]])

In [19]:
np.vstack([my_list1, my_list2])

array([[1, 2],
       [3, 4],
       [5, 6],
       [7, 8]])

In [20]:
np.zeros(3)

array([0., 0., 0.])

In [21]:
np.zeros((3,3))

array([[0., 0., 0.],
       [0., 0., 0.],
       [0., 0., 0.]])

In [22]:
np.ones(3)

array([1., 1., 1.])

In [23]:
np.ones(3) * 10

array([10., 10., 10.])

In [24]:
np.linspace(0, 10, 5)

array([ 0. ,  2.5,  5. ,  7.5, 10. ])

In [25]:
np.linspace(1900, 2000, 11)

array([1900., 1910., 1920., 1930., 1940., 1950., 1960., 1970., 1980.,
       1990., 2000.])

In [26]:
np.eye(3)

array([[1., 0., 0.],
       [0., 1., 0.],
       [0., 0., 1.]])

In [27]:
np.random.rand(3)

array([0.22210563, 0.63932753, 0.06685526])

In [28]:
np.random.rand(3,3)

array([[0.02337088, 0.52688624, 0.8004706 ],
       [0.22950525, 0.77798821, 0.73926366],
       [0.20547568, 0.68666393, 0.85072971]])

In [29]:
np.random.randn(3)

array([-0.30628445,  1.68106928,  1.77430866])

In [33]:
x = np.random.randn(1000000)

In [34]:
x.mean()

-0.0008611862447495295

In [35]:
x.std()

0.999410166406746

In [36]:
np.random.randint(1,101,5)

array([27,  6, 21,  8,  2])

In [37]:
vector = np.arange(1,10)

In [38]:
vector

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [40]:
vector.reshape(3,2)

ValueError: cannot reshape array of size 9 into shape (3,2)

In [41]:
vector = np.array([1, 10, 20, 20, 1])

In [42]:
vector.argmax()

2

In [44]:
x = [1, 2, 3, 4, 5]
x[1:3] = [6,]

In [45]:
x

[1, 6, 4, 5]

In [46]:
vector[3:6] = 12

In [47]:
vector

array([ 1, 10, 20, 12, 12])

In [48]:
vector = np.array(range(10))
my_slice = vector[3:7]
my_slice[:] = 20
print(vector)

[ 0  1  2 20 20 20 20  7  8  9]

In [50]:
matrix = np.array(range(1,10)).reshape((3,3))
matrix[0,0]

1

In [51]:
matrix[0][0]

1

In [52]:
vector = np.arange(10)
gt2 = vector > 2 # create condition
lt8 = vector < 8 # create condition

In [53]:
gt2

array([False, False, False,  True,  True,  True,  True,  True,  True,
        True])

In [54]:
lt8

array([ True,  True,  True,  True,  True,  True,  True,  True, False,
       False])

In [55]:
vector[gt2]

array([3, 4, 5, 6, 7, 8, 9])

In [57]:
vector[lt8]

array([0, 1, 2, 3, 4, 5, 6, 7])

In [58]:
vector[vector>2]

array([3, 4, 5, 6, 7, 8, 9])

In [60]:
cond = (vector>2) & (vector<7)
vector[cond]

array([3, 4, 5, 6])

In [61]:
sum(vector<5)

5

In [62]:
vector<5

array([ True,  True,  True,  True,  True, False, False, False, False,
       False])

In [63]:
import math
vector = np.arange(1,11) * math.pi 
np.sin(vector)

array([ 1.22464680e-16, -2.44929360e-16,  3.67394040e-16, -4.89858720e-16,
        6.12323400e-16, -7.34788079e-16,  8.57252759e-16, -9.79717439e-16,
        1.10218212e-15, -1.22464680e-15])

In [64]:
vector = np.arange(0,math.pi+math.pi/4,math.pi/4)
np.sin(vector)

array([0.00000000e+00, 7.07106781e-01, 1.00000000e+00, 7.07106781e-01,
       1.22464680e-16])

In [65]:
matrix = np.random.rand(5,5)

In [66]:
matrix

array([[0.04674561, 0.12901766, 0.59241033, 0.75942826, 0.28116428],
       [0.8788953 , 0.56109265, 0.93132182, 0.08641455, 0.12616307],
       [0.02836478, 0.82878763, 0.49297612, 0.89131705, 0.48873447],
       [0.17512385, 0.83648223, 0.93703105, 0.30959547, 0.11160961],
       [0.81849929, 0.93885594, 0.66990099, 0.88470128, 0.72001693]])

In [67]:
np.floor(matrix*1000)/1000

array([[0.046, 0.129, 0.592, 0.759, 0.281],
       [0.878, 0.561, 0.931, 0.086, 0.126],
       [0.028, 0.828, 0.492, 0.891, 0.488],
       [0.175, 0.836, 0.937, 0.309, 0.111],
       [0.818, 0.938, 0.669, 0.884, 0.72 ]])

In [70]:
np.round(matrix, 3)

array([[0.047, 0.129, 0.592, 0.759, 0.281],
       [0.879, 0.561, 0.931, 0.086, 0.126],
       [0.028, 0.829, 0.493, 0.891, 0.489],
       [0.175, 0.836, 0.937, 0.31 , 0.112],
       [0.818, 0.939, 0.67 , 0.885, 0.72 ]])

In [71]:
np.floor(matrix)

array([[0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.]])

In [72]:
matrix = np.arange(1,10).reshape(3,3)

In [73]:
matrix

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [74]:
matrix.sum(axis=1)

array([ 6, 15, 24])

In [75]:
matrix.sum(axis=0)

array([12, 15, 18])

In [76]:
matrix.cumsum()

array([ 1,  3,  6, 10, 15, 21, 28, 36, 45], dtype=int32)

In [77]:
matrix.min()

1

In [79]:
matrix.min(axis=0)

array([1, 2, 3])

In [80]:
matrix = np.array([1,2,3]*3).reshape(3,3)
np.unique(matrix.reshape(3,3))

array([1, 2, 3])

In [81]:
matrix

array([[1, 2, 3],
       [1, 2, 3],
       [1, 2, 3]])

In [82]:
import numpy as np
import pandas as pd

header = ['chrom', 'pos', 'filter']
data = [4, 12345, 38.4]

vector = np.array(data)
data_dict = {'chrom': 4, 'pos': 12345, 'filter': 38.4}

s1 = pd.Series(data=data) # Notice the data type is float

In [83]:
s1

0        4.0
1    12345.0
2       38.4
dtype: float64

In [86]:
s1[0]

4.0

In [84]:
s2 = pd.Series(data=data, index=header)

In [85]:
s2

chrom         4.0
pos       12345.0
filter       38.4
dtype: float64

In [87]:
s2['chrom']

self.index = {
    'chrom': 0
}
self.index = {
    0: 0
}

4.0

In [88]:
s2[0]

4.0

In [89]:
header1 = ['chrom', 'pos', 'filter']
data1 = [4, 12345, 38.4]
header2 = ['chrom', 'pos', 'filter', 'qual']
data2 = [3, 4899, 234, 89.9]

s1 = pd.Series(data1, header1)
s2 = pd.Series(data2, header2)
s1+s2

chrom         7.0
filter      272.4
pos       17244.0
qual          NaN
dtype: float64

In [90]:
header1 = ['chrom', 'pos', 'filter']
data1 = [4, 12345, 38.4]
header2 = ['chrom', 'pos', 'filter', 'qual']
data2 = ['3', 4899, 234, 89.9]

s1 = pd.Series(data1, header1)
s2 = pd.Series(data2, header2)
s1+s2

TypeError: unsupported operand type(s) for +: 'float' and 'str'

In [91]:
data1 = [4, 12345, 38.4]
data2 = [3, 4899, 234, 89.9]

s1 = pd.Series(data1)
s2 = pd.Series(data2)

In [92]:
s1 + s2

0        7.0
1    17244.0
2      272.4
3        NaN
dtype: float64

In [93]:
header1 = ['pos', 'filter', 'chrom']
data1 = [12345, 38.4, 4]
header2 = ['chrom', 'pos', 'filter', 'qual']
data2 = [3, 4899, 234, 89.9]

s1 = pd.Series(data1, header1)
s2 = pd.Series(data2, header2)
s1+s2

chrom         7.0
filter      272.4
pos       17244.0
qual          NaN
dtype: float64

In [94]:
data1 = [12345, 38.4, 4]
data2 = [3, 4899, 234, 89.9]

s1 = pd.Series(data1)
s2 = pd.Series(data2)

In [95]:
s1+s2

0    12348.0
1     4937.4
2      238.0
3        NaN
dtype: float64

In [97]:
import numpy as np
import pandas as pd

header = ['exam1', 'exam2', 'exam3']
data = np.random.randint(65, 101, 12).reshape(4,3)
students = ['student1', 'student2', 'student3', 'student4']

df = pd.DataFrame(data=data, columns=header)

df = pd.DataFrame(data=data, index=students, columns=header)

In [98]:
df = pd.DataFrame(data)

In [100]:
df = pd.DataFrame(data=data, columns=header)
df

   exam1  exam2  exam3
0     86     92     68
1     97     69     87
2     78     89     68
3     68     90     87

In [101]:
df = pd.DataFrame(data=data, index=students, columns=header)

In [102]:
df

          exam1  exam2  exam3
student1     86     92     68
student2     97     69     87
student3     78     89     68
student4     68     90     87

In [103]:
df['exam1']

student1    86
student2    97
student3    78
student4    68
Name: exam1, dtype: int32

In [104]:
df.exam1

student1    86
student2    97
student3    78
student4    68
Name: exam1, dtype: int32

In [105]:
df['average'] = (df['exam1'] + df['exam2'] + df['exam3'])/3

In [108]:
df

          exam1  exam2  exam3    average
student1     86     92     68  82.000000
student2     97     69     87  84.333333
student3     78     89     68  78.333333
student4     68     90     87  81.666667

In [114]:
df.drop('average', axis=1)

          exam1  exam2  exam3
student1     86     92     68
student2     97     69     87
student3     78     89     68
student4     68     90     87

'1.4.4'

In [115]:
df

          exam1  exam2  exam3    average
student1     86     92     68  82.000000
student2     97     69     87  84.333333
student3     78     89     68  78.333333
student4     68     90     87  81.666667

In [116]:
df.drop('average', axis=1, inplace=True)

In [119]:
df

          exam1  exam2  exam3
student1     86     92     68
student2     97     69     87
student3     78     89     68
student4     68     90     87

In [118]:
df.drop('student3')

          exam1  exam2  exam3
student1     86     92     68
student2     97     69     87
student4     68     90     87

In [120]:
df

          exam1  exam2  exam3
student1     86     92     68
student2     97     69     87
student3     78     89     68
student4     68     90     87

In [121]:
header = ['exam1', 'exam2', 'exam3']
data = np.random.randint(65, 101, 12).reshape(4,3)
students = ['student1', 'student2', 'student3', 'student3']
df = pd.DataFrame(data=data, index=students, columns=header)

In [122]:
df

          exam1  exam2  exam3
student1     66     81     72
student2     73     83     91
student3     80     94     80
student3     76     75     82

In [123]:
header = ['exam1', 'exam2', 'exam3']
data = np.random.randint(65, 101, 12).reshape(4,3)
students = ['student1', 'student2', 'student3', 'student4']
df = pd.DataFrame(data=data, index=students, columns=header)

# df.loc['student1']
# df.iloc[0] ## remember that column names do not count as rows

In [124]:
df

          exam1  exam2  exam3
student1     70     96     82
student2     74     65     65
student3     76     83     88
student4     82     74     98

In [128]:
import pandas as pd
columns = ('StudentName', 'E1', 'E2', 'E3', 'E4','E5')
df = pd.DataFrame(data=[ele.strip().split(',') for ele in open('testdata_1.txt')]) 
display(df[0])

0     student1
1     student2
2     student3
3     student4
4     student5
5     student6
6     student7
7     student8
8     student9
9    student10
Name: 0, dtype: object

In [130]:
import pandas as pd
columns = ('StudentName', 'E1', 'E2', 'E3', 'E4','E5')
df = pd.DataFrame(data=[ele.strip().split(',') for ele in open('testdata_1.txt')], columns=columns)
display(df['1:5'])

TypeError: cannot do slice indexing on RangeIndex with these indexers [StudentName] of type str

In [131]:
df

  StudentName   E1  E2  E3  E4  E5
0    student1   92  77  87  77  94
1    student2   74  93  88  67  85
2    student3   83  96  74  79  92
3    student4  100  72  83  85  66
4    student5   77  96  66  79  92
5    student6  100  86  84  70  71
6    student7   66  91  94  97  80
7    student8   97  86  75  69  88
8    student9   95  98  99  85  86
9   student10   78  76  73  88  86

In [134]:
import pandas as pd
columns = ('StudentName', 'E1', 'E2', 'E3', 'E4','E5')
df = pd.DataFrame(data=[ele.strip().split(',') for ele in open('testdata_1.txt')], columns=columns)
df.set_index(df['StudentName'], inplace=True) 
display(df.loc['student2':'student9', :])

            StudentName   E1  E2  E3  E4  E5
StudentName
student2       student2   74  93  88  67  85
student3       student3   83  96  74  79  92
student4       student4  100  72  83  85  66
student5       student5   77  96  66  79  92
student6       student6  100  86  84  70  71
student7       student7   66  91  94  97  80
student8       student8   97  86  75  69  88
student9       student9   95  98  99  85  86

In [136]:
import pandas as pd
columns = ('StudentName', 'E1', 'E2', 'E3', 'E4','E5')
df = pd.DataFrame(data=[ele.strip().split(',') for ele in open('testdata_1.txt')], columns=columns)
df.set_index(df['StudentName'], inplace=True) 
display(df.loc[:, 'E1':'E4'])

              E1  E2  E3  E4
StudentName
student1      92  77  87  77
student2      74  93  88  67
student3      83  96  74  79
student4     100  72  83  85
student5      77  96  66  79
student6     100  86  84  70
student7      66  91  94  97
student8      97  86  75  69
student9      95  98  99  85
student10     78  76  73  88

In [137]:
import pandas as pd
columns = ('StudentName', 'E1', 'E2', 'E3', 'E4','E5')
df = pd.DataFrame(data=[ele.strip().split(',') for ele in open('testdata_1.txt')], columns=columns)
for column_name, column in df.iteritems():
    print(column_name, column)

StudentName 0     student1
1     student2
2     student3
3     student4
4     student5
5     student6
6     student7
7     student8
8     student9
9    student10
Name: StudentName, dtype: object
E1 0     92
1     74
2     83
3    100
4     77
5    100
6     66
7     97
8     95
9     78
Name: E1, dtype: object
E2 0    77
1    93
2    96
3    72
4    96
5    86
6    91
7    86
8    98
9    76
Name: E2, dtype: object
E3 0    87
1    88
2    74
3    83
4    66
5    84
6    94
7    75
8    99
9    73
Name: E3, dtype: object
E4 0    77
1    67
2    79
3    85
4    79
5    70
6    97
7    69
8    85
9    88
Name: E4, dtype: object
E5 0    94
1    85
2    92
3    66
4    92
5    71
6    80
7    88
8    86
9    86
Name: E5, dtype: object

In [138]:
header = ['exam1', 'exam2', 'exam3']
data = np.random.randint(65, 101, 12).reshape(4,3)
students = ['student1', 'student2', 'student3', 'student4']
df = pd.DataFrame(data=data, index=students, columns=header)

In [139]:
df

          exam1  exam2  exam3
student1     85     82     79
student2     73     98     93
student3     71     73     96
student4     96     76     84

In [140]:
df>=90
df[df>=90]

          exam1  exam2  exam3
student1    NaN    NaN    NaN
student2    NaN   98.0   93.0
student3    NaN    NaN   96.0
student4   96.0    NaN    NaN

In [141]:
df['exam1']>=85 #   
df[df['exam1']>=85] # gives all columns where exam1 is greater than 85

          exam1  exam2  exam3
student1     85     82     79
student4     96     76     84

In [142]:
df[df['exam1']>=85]['exam3'] 
df[df['exam1']>=85][['exam2', 'exam3']]

          exam2  exam3
student1     82     79
student4     76     84

In [143]:
students = 'student1 student1 student1 student2 student2 student2 student3 student3 student3'
exams = 'exam1 exam2 exam3'.split()*3
classes = 'class1 class2'
index = list(zip(students.split(), exams))
index = pd.MultiIndex.from_tuples(index)
df = pd.DataFrame(np.random.randint(65, 101, 3*3*2).reshape(9,2) , index, classes.split())
df.loc['student1'].loc['exam1']['class1'] 
df.index.names
df.index.names = ['Students', 'Exams']

In [144]:
df

                class1  class2
Students Exams
student1 exam1      70      75
         exam2      66      98
         exam3      67      76
student2 exam1      68      90
         exam2      89      66
         exam3      77      97
student3 exam1      82      72
         exam2      71      86
         exam3      97      77

In [145]:
df.xs('student1')

       class1  class2
Exams
exam1      70      75
exam2      66      98
exam3      67      76

In [146]:
df.xs('exam1', level='Exams')

          class1  class2
Students
student1      70      75
student2      68      90
student3      82      72

In [147]:
my_dict = {'student1': [90, 84, np.nan], 'student2': [77, np.nan, np.nan], 'student3': [88, 65, 93]}
df = pd.DataFrame(my_dict)

In [148]:
df

   student1  student2  student3
0      90.0      77.0        88
1      84.0       NaN        65
2       NaN       NaN        93

In [149]:
df.dropna()

   student1  student2  student3
0      90.0      77.0        88

In [150]:
df.dropna(axis=0)

   student1  student2  student3
0      90.0      77.0        88

In [151]:
df.dropna(axis=1)

   student3
0        88
1        65
2        93

In [152]:
df.dropna(thresh=2)

   student1  student2  student3
0      90.0      77.0        88
1      84.0       NaN        65

In [153]:
df.fillna(value=55)

   student1  student2  student3
0      90.0      77.0        88
1      84.0      55.0        65
2      55.0      55.0        93

In [154]:
df.drop(axis=0, labels=['student1','student5'])

   student1  student2  student3
0      90.0      77.0        88

In [155]:
import pandas as pd
columns = ('StudentName', 'E1', 'E2', 'E3', 'E4','E5')
df = pd.DataFrame(data=[ele.strip().split(',') for ele in open('testdata_1.txt')], columns=columns)
df.set_index(df['StudentName'], inplace=True)

In [156]:
df

            StudentName   E1  E2  E3  E4  E5
StudentName
student1       student1   92  77  87  77  94
student2       student2   74  93  88  67  85
student3       student3   83  96  74  79  92
student4       student4  100  72  83  85  66
student5       student5   77  96  66  79  92
student6       student6  100  86  84  70  71
student7       student7   66  91  94  97  80
student8       student8   97  86  75  69  88
student9       student9   95  98  99  85  86
student10     student10   78  76  73  88  86

In [157]:
df.drop(axis=0, labels=['student1','student5'])

            StudentName   E1  E2  E3  E4  E5
StudentName
student2       student2   74  93  88  67  85
student3       student3   83  96  74  79  92
student4       student4  100  72  83  85  66
student6       student6  100  86  84  70  71
student7       student7   66  91  94  97  80
student8       student8   97  86  75  69  88
student9       student9   95  98  99  85  86
student10     student10   78  76  73  88  86

In [158]:
my_dict = {'student1': [90, 84, np.nan], 'student2': [77, np.nan, np.nan], 'student3': [88, 65, 93]}
df = pd.DataFrame(my_dict)
df.drop(axis=1, columns=['student1'])

   student2  student3
0      77.0        88
1       NaN        65
2       NaN        93

In [159]:
my_dict = {
    'Exams': 'exam1 exam1 exam1'.split() + 'exam2 exam2 exam2'.split() + 'exam3 exam3 exam3'.split(),
    'Students': 'student1 student2 student3'.split()*3,   
    'Scores': np.random.randint(65,101,9)
}
df = pd.DataFrame(my_dict)

In [160]:
df

   Exams  Students  Scores
0  exam1  student1      97
1  exam1  student2      76
2  exam1  student3      81
3  exam2  student1      81
4  exam2  student2      68
5  exam2  student3      83
6  exam3  student1      88
7  exam3  student2      77
8  exam3  student3      96

In [161]:
df.groupby('Students').mean()

             Scores
Students
student1  88.666667
student2  73.666667
student3  86.666667

In [162]:
df.groupby('Students').mean().loc['student1']

Scores    88.666667
Name: student1, dtype: float64

In [163]:
df.groupby('Exams').max()['Scores']

Exams
exam1    97
exam2    83
exam3    96
Name: Scores, dtype: int32

In [164]:
df.groupby('Exams').describe()

      Scores
       count       mean        std   min   25%   50%   75%   max
Exams
exam1    3.0  84.666667  10.969655  76.0  78.5  81.0  89.0  97.0
exam2    3.0  77.333333   8.144528  68.0  74.5  81.0  82.0  83.0
exam3    3.0  87.000000   9.539392  77.0  82.5  88.0  92.0  96.0

In [165]:
df.groupby('Students').describe().transpose()

Students       student1   student2   student3
Scores count   3.000000   3.000000   3.000000
       mean   88.666667  73.666667  86.666667
       std     8.020806   4.932883   8.144528
       min    81.000000  68.000000  81.000000
       25%    84.500000  72.000000  82.000000
       50%    88.000000  76.000000  83.000000
       75%    92.500000  76.500000  89.500000
       max    97.000000  77.000000  96.000000

In [189]:
departments = { 
    'DepartmentId': [1, 2, 3, 4],
    'DepartmentName': ['IT', 'Physics', 'Arts', 'Math'] 
}

df1 = pd.DataFrame(departments)

students = {
    'StudentId': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    'StudentName': ['Michael', 'John', 'Jack', 'Sara', 'Sally', 'Jena', 'Nancy', 'Adam', 'Stevens', 'George'],
    'DepartmentId': [1, 1, 1, 2, 2, np.nan, 2, 3, 3, np.nan]
}

df2 = pd.DataFrame(students)

marks = {
    'MarkId': [1, 2, 3, 4, 5, 6, 7, 8],
    'StudentId': [1, 2, 3, 4, 5, 6, 7, 8], 
    'Mark': [18, 20, 16, 19, 14, 20, 20, 20]
}

df3 = pd.DataFrame(marks)

pd.merge(df2, df1, how='inner', on='DepartmentId')

   StudentId StudentName  DepartmentId DepartmentName
0          1     Michael           1.0             IT
1          2        John           1.0             IT
2          3        Jack           1.0             IT
3          4        Sara           2.0        Physics
4          5       Sally           2.0        Physics
5          7       Nancy           2.0        Physics
6          8        Adam           3.0           Arts
7          9     Stevens           3.0           Arts

In [171]:
pd.merge(df1, df2, how='inner', on='DepartmentId')

   DepartmentId DepartmentName  StudentId StudentName
0             1             IT          1     Michael
1             1             IT          2        John
2             1             IT          3        Jack
3             2        Physics          4        Sara
4             2        Physics          5       Sally
5             2        Physics          7       Nancy
6             3           Arts          8        Adam
7             3           Arts          9     Stevens

In [168]:
df2

   StudentId StudentName  DepartmentId
0          1     Michael           1.0
1          2        John           1.0
2          3        Jack           1.0
3          4        Sara           2.0
4          5       Sally           2.0
5          6        Jena           NaN
6          7       Nancy           2.0
7          8        Adam           3.0
8          9     Stevens           3.0
9         10      George           NaN

In [169]:
df3

   MarkId  StudentId  Mark
0       1          1    18
1       2          2    20
2       3          3    16
3       4          4    19
4       5          5    14
5       6          6    20
6       7          7    20
7       8          8    20

In [172]:
pd.merge(df1, df2, how='outer', on='DepartmentId')

    DepartmentId DepartmentName  StudentId StudentName
0            1.0             IT        1.0     Michael
1            1.0             IT        2.0        John
2            1.0             IT        3.0        Jack
3            2.0        Physics        4.0        Sara
4            2.0        Physics        5.0       Sally
5            2.0        Physics        7.0       Nancy
6            3.0           Arts        8.0        Adam
7            3.0           Arts        9.0     Stevens
8            4.0           Math        NaN         NaN
9            NaN            NaN        6.0        Jena
10           NaN            NaN       10.0      George

In [173]:
pd.merge(df2, df1, how='right', on='DepartmentId')

   StudentId StudentName  DepartmentId DepartmentName
0        1.0     Michael           1.0             IT
1        2.0        John           1.0             IT
2        3.0        Jack           1.0             IT
3        4.0        Sara           2.0        Physics
4        5.0       Sally           2.0        Physics
5        7.0       Nancy           2.0        Physics
6        8.0        Adam           3.0           Arts
7        9.0     Stevens           3.0           Arts
8        NaN         NaN           4.0           Math

In [174]:
pd.merge(df3, pd.merge(df2, df1, how='inner', on='DepartmentId'), how='inner', on='StudentId')
data = pd.merge(df3, pd.merge(df2, df1, how='inner', on='DepartmentId'), how='inner', on='StudentId')
data

   MarkId  StudentId  Mark StudentName  DepartmentId DepartmentName
0       1          1    18     Michael           1.0             IT
1       2          2    20        John           1.0             IT
2       3          3    16        Jack           1.0             IT
3       4          4    19        Sara           2.0        Physics
4       5          5    14       Sally           2.0        Physics
5       7          7    20       Nancy           2.0        Physics
6       8          8    20        Adam           3.0           Arts

In [176]:
d1 = {
    'C0': ['COR0', 'COR1', 'COR2'],
    'C1': ['C1R0', 'C1R1', 'C2R2'],
    'C2': ['C2R0', 'C2R1', 'C2R2'],
}

df1 = pd.DataFrame(d1)

d2 = {
    'C0': ['C0R3', 'C0R4', 'C0R5'],
    'C1': ['C1R3', 'C1R4', 'C1R5'],
    'C2': ['C2R3', 'C2R4', 'C2R5'],
}

df2 = pd.DataFrame(d2)

d3 = {
    'C0': ['C0R6', 'C0R7', 'C0R8'],
    'C1': ['C1R6', 'C1R7', 'C1R8'],
    'C2': ['C2R6', 'C2R7', 'C2R8'],
}

df3 = pd.DataFrame(d3)

ndf = pd.concat([df1, df2, df3])

In [177]:
ndf

     C0    C1    C2
0  COR0  C1R0  C2R0
1  COR1  C1R1  C2R1
2  COR2  C2R2  C2R2
0  C0R3  C1R3  C2R3
1  C0R4  C1R4  C2R4
2  C0R5  C1R5  C2R5
0  C0R6  C1R6  C2R6
1  C0R7  C1R7  C2R7
2  C0R8  C1R8  C2R8

In [178]:
ndf.loc[0]

     C0    C1    C2
0  COR0  C1R0  C2R0
0  C0R3  C1R3  C2R3
0  C0R6  C1R6  C2R6

In [179]:
ndf.iloc[0]

C0    COR0
C1    C1R0
C2    C2R0
Name: 0, dtype: object

In [181]:
data['DepartmentName']

0         IT
1         IT
2         IT
3    Physics
4    Physics
5    Physics
6       Arts
Name: DepartmentName, dtype: object

In [182]:
data['DepartmentName'].nunique()

3

In [183]:
data['DepartmentName'].value_counts()

IT         3
Physics    3
Arts       1
Name: DepartmentName, dtype: int64

In [184]:
data[data['Mark']>17]

   MarkId  StudentId  Mark StudentName  DepartmentId DepartmentName
0       1          1    18     Michael           1.0             IT
1       2          2    20        John           1.0             IT
3       4          4    19        Sara           2.0        Physics
5       7          7    20       Nancy           2.0        Physics
6       8          8    20        Adam           3.0           Arts

In [185]:
def times5(val):
    return val * 5

data['Mark'].apply(times5)

0     90
1    100
2     80
3     95
4     70
5    100
6    100
Name: Mark, dtype: int64

In [186]:
data['Mark'].apply(lambda val: val*5)

0     90
1    100
2     80
3     95
4     70
5    100
6    100
Name: Mark, dtype: int64

In [187]:
def upper(string):
    return string.upper()

data['DepartmentName'].apply(upper)

data['DepartmentName'].apply(lambda string: string.upper())

0         IT
1         IT
2         IT
3    PHYSICS
4    PHYSICS
5    PHYSICS
6       ARTS
Name: DepartmentName, dtype: object

In [190]:
mapping = {18: 'B', 14: 'C', 19: 'A-', 20: 'A+'}
df3['Mark'].map(mapping)

0      B
1     A+
2    NaN
3     A-
4      C
5     A+
6     A+
7     A+
Name: Mark, dtype: object

In [191]:
data.sort_values('Mark')
data.sort_values('Mark', ascending=False)

   MarkId  StudentId  Mark StudentName  DepartmentId DepartmentName
1       2          2    20        John           1.0             IT
5       7          7    20       Nancy           2.0        Physics
6       8          8    20        Adam           3.0           Arts
3       4          4    19        Sara           2.0        Physics
0       1          1    18     Michael           1.0             IT
2       3          3    16        Jack           1.0             IT
4       5          5    14       Sally           2.0        Physics

In [192]:
data = pd.read_csv('students.tsv', sep='\t', names=['lastname', 'firstname', 'username', 'exam1', 'exam2', 'exam3'])

In [193]:
data

     lastname  firstname       username  exam1  exam2  exam3
0      Larson    Melissa     larsonmeli     24     89     31
1       Novak    Melissa      novakmeli     77      3     38
2      Sawyer      Wendy     sawyerwend     81     59     30
3     Schultz     Marcus    schultzmarc     59     29     67
4        Vega   Nicholas       veganich     64     12     95
..        ...        ...            ...    ...    ...    ...
95     Duncan     Andrew     duncanandr     59     87     34
96       Bush  Alexander       bushalex     82     54     25
97    Summers    Michael    summersmich     18     95     63
98     Bowers     Sandra     bowerssand     52      8     50
99  Fernandez   Jonathan  fernandezjona     74     80     22

[100 rows x 6 columns]

In [195]:
data['exam3'] + data['exam2']

0     120
1      41
2      89
3      96
4     107
     ...
95    121
96     79
97    158
98     58
99    102
Length: 100, dtype: int64

In [196]:
data[['exam1', 'exam2', 'exam3']].mean()

exam1    50.01
exam2    51.51
exam3    51.14
dtype: float64

In [197]:
data['average']= np.mean(data[['exam1', 'exam2', 'exam3']], axis=1)

In [198]:
data

     lastname  firstname       username  exam1  exam2  exam3    average
0      Larson    Melissa     larsonmeli     24     89     31  48.000000
1       Novak    Melissa      novakmeli     77      3     38  39.333333
2      Sawyer      Wendy     sawyerwend     81     59     30  56.666667
3     Schultz     Marcus    schultzmarc     59     29     67  51.666667
4        Vega   Nicholas       veganich     64     12     95  57.000000
..        ...        ...            ...    ...    ...    ...        ...
95     Duncan     Andrew     duncanandr     59     87     34  60.000000
96       Bush  Alexander       bushalex     82     54     25  53.666667
97    Summers    Michael    summersmich     18     95     63  58.666667
98     Bowers     Sandra     bowerssand     52      8     50  36.666667
99  Fernandez   Jonathan  fernandezjona     74     80     22  58.666667

[100 rows x 7 columns]

In [201]:
data = data.sort_values('average', ascending=False)

In [202]:
data.to_csv('output.tsv', sep='\t', index=False, header=False)

In [203]:
data.head()

     lastname firstname       username  exam1  exam2  exam3    average
48     Ramsey      John     ramseyjohn     89     95     94  92.666667
69      Frank   Jessica      frankjess     95     87     92  91.333333
31    Terrell    Robert    terrellrobe     99     93     60  84.000000
56     Ashley      Cody     ashleycody     75     69     94  79.333333
39  Henderson  Michelle  hendersonmich     91     60     86  79.000000

In [204]:
data.value_counts()

lastname   firstname  username       exam1  exam2  exam3  average
Adams      Brenda     adamsbren      80     49     60     63.000000    1
Munoz      Mary       munozmary      77     41     55     57.666667    1
Patterson  Jennifer   pattersonjenn  26     98     97     73.666667    1
Patrick    Rachel     patrickrach    16     20     80     38.666667    1
Parsons    Cassie     parsonscass    61     62     65     62.666667    1
                                                                      ..
Garcia     Brian      garciabria     37     53     3      31.000000    1
Gamble     Matthew    gamblematt     48     50     26     41.333333    1
Gallegos   Eugene     gallegoseuge   34     9      76     39.666667    1
Frank      Jessica    frankjess      95     87     92     91.333333    1
Woodard    Judy       woodardjudy    47     43     13     34.333333    1
Length: 100, dtype: int64

In [205]:
data.describe()

            exam1       exam2       exam3     average
count  100.000000  100.000000  100.000000  100.000000
mean    50.010000   51.510000   51.140000   50.886667
std     26.417585   28.497561   28.291777   16.222307
min      2.000000    1.000000    2.000000   10.333333
25%     26.750000   26.500000   27.750000   39.583333
50%     52.000000   51.500000   51.000000   50.833333
75%     73.000000   77.000000   71.500000   60.333333
max     99.000000   98.000000   98.000000   92.666667

In [206]:
data[data['exam1'].between(75, 85)]

   lastname  firstname     username  exam1  exam2  exam3    average
56   Ashley       Cody   ashleycody     75     69     94  79.333333
14  Mcclain      Glenn  mcclainglen     85     98     52  78.333333
61   Graham    Vanessa   grahamvane     78     76     73  75.666667
87    Chang    Kristen    changkris     78     55     94  75.666667
11     Paul     Philip     paulphil     79     86     60  75.000000
5     Adams     Brenda    adamsbren     80     49     60  63.000000
52     Kerr      Sarah     kerrsara     82     27     65  58.000000
9     Munoz       Mary    munozmary     77     41     55  57.666667
2    Sawyer      Wendy   sawyerwend     81     59     30  56.666667
7     Booth    Bradley    boothbrad     85      8     77  56.666667
96     Bush  Alexander     bushalex     82     54     25  53.666667
45   Patton     Robert   pattonrobe     78     53     20  50.333333
44  Santana      Linda  santanalind     77     58      4  46.333333
22   Gibson     Edward   gibsonedwa     84     27     21  44.000000
1     Novak    Melissa    novakmeli     77      3     38  39.333333

In [207]:
data[data['exam1'].isin([75, 85, 95])]

   lastname firstname     username  exam1  exam2  exam3    average
69    Frank   Jessica    frankjess     95     87     92  91.333333
56   Ashley      Cody   ashleycody     75     69     94  79.333333
14  Mcclain     Glenn  mcclainglen     85     98     52  78.333333
7     Booth   Bradley    boothbrad     85      8     77  56.666667

In [208]:
data['exam1'].unique()

array([89, 95, 99, 75, 91, 73, 85, 78, 79, 26, 41, 64, 87, 52, 70, 32, 59,
       80, 50, 61, 71, 47, 54, 74, 18, 82, 77, 11, 81, 29, 10, 94, 22, 33,
       93,  6, 66, 72, 57, 23, 25, 24, 53, 15, 43, 44, 36, 21,  3, 84, 48,
       67, 37, 34, 16, 28,  9, 30,  2, 65, 38, 20, 27], dtype=int64)